junhuanchen/simplelink_cc13xx_cc26xx_sdk_7_10_01_24/examples/nortos/LP_CC1352P7_1/mcuboot/mcuboot/mcuboot.syscfg
/*
 * Copyright (c) 2022, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
// @cliArgs --board /ti/boards/LP_CC1352P7_1 --rtos nortos

/*
 *  mcuboot.syscfg
 */


const Board = scripting.addModule("/ti/drivers/Board");

/* ======== Board ======== */
var boardName = system.deviceData.board.name;

/**
 * Import the modules used in this configuration.
 */
const CCFG = scripting.addModule("/ti/devices/CCFG");
const ccfgSettings = system.getScript("/ti/common/lprf_ccfg_settings.js").ccfgSettings;
for(var setting in ccfgSettings)
{
    CCFG[setting] = ccfgSettings[setting];
}

if (boardName.match(/CC13.2.7|CC26.2.7/))
{
    // mcuboot stored at end of flash alongside CCFG
    CCFG.setFlashVectorTable = true;
    CCFG.addressFlashVectorTable = 0x000AC000;
}
else if (boardName.match(/CC13.4|CC26.[34]/))
{
    // mcuboot stored at the beginning of flash
    CCFG.setFlashVectorTable = true;
    CCFG.addressFlashVectorTable = 0x00000000;
}
else if (boardName.match(/CC23.0/)) {
    // Nothing to do. Default pBldrVtor = 0x00000000
}
else
{
    // error
}

CCFG.ccfgTemplate.$name      = "ti_devices_CCFG_CCFGCC26XXTemplate0";

/* ======== GPIO ======== */
var GPIO = scripting.addModule("/ti/drivers/GPIO");

var gpio0 = GPIO.addInstance();
gpio0.$hardware = system.deviceData.board.components.LED0;
gpio0.$name = "CONFIG_GPIO_LED_0";

var gpio1 = GPIO.addInstance();
gpio1.$hardware = system.deviceData.board.components.LED1;
gpio1.$name = "CONFIG_GPIO_LED_1";

var gpio2 = GPIO.addInstance();
gpio2.$hardware = system.deviceData.board.components.BUTTON0;
gpio2.$name = "CONFIG_GPIO_BUTTON_0";

var gpio3 = GPIO.addInstance();
gpio3.$hardware = system.deviceData.board.components.BUTTON1;
gpio3.$name = "CONFIG_GPIO_BUTTON_1";
